#include "Delay.h"

/*******************************************************
 函数名：Delayms_Bus_Clock_16
 参数：ms延时时间毫秒    
*******************************************************/
void Delayms_Bus_Clock_16(uint ms)
{   
   int ii,jj;
   if (ms < 1) 
   { 
      ms = 1;
   }
   for (ii = ms; ii >0 ; ii--)
   {
       for (jj = 2665; jj >0 ; jj--);    //延时
   } 
  
}

/*******************************************************
 函数名：Delayus
 参数：1us    
*******************************************************/
void Delayus(void)    
{
  unsigned char i;

  for(i=20;i>0;i--)
  {
    _asm nop;
  }
}