#ifndef Motor_H
#define Motor_H



#include "COMMON.h"
#include "Users.h"


/*************************************************
函数名: Motor_Stop()
描述: 电机停止
输入: 无
输出: 无
*************************************************/
void Motor_Stop(void); 


/*************************************************
函数名: Left_Motor_Forward
描述: 左电机前进
输入: duty:PWM01占空比
输出: 无
*************************************************/
void Left_Motor_Forward(uint duty);
/*************************************************
函数名: Right_Motor_Forward
描述: 右电机前进
输入: duty:PWM45占空比
输出: 无
*************************************************/
void Right_Motor_Forward(uint duty); 
/*************************************************
函数名: Left_Motor_Back
描述: 左电机后退
输入: duty:PWM01占空比
输出: 无
*************************************************/
void Left_Motor_Back(uint duty);
/*************************************************
函数名: Right_Motor_Back
描述: 右电机后退
输入: duty:PWM45占空比
输出: 无
*************************************************/
void Right_Motor_Back(uint duty); 









#endif