#include "PIT.h"


/*******************************************************
 函数名：Init_PIT0_5ms
 参数：无
 说明：Time_out=(PITMTLD+1)*(PITLD+1)/f_bus   
 功能：初始化周期定时器0，每隔5ms获取当前速度并调整
*******************************************************/
void Init_PIT0_5ms(void)
{
    PITMTLD0 = 199;     //8位micro timer0 初值
    PITCFLMT = 0X83;    //使能PIT并强制加载8位定时器0
    PITMUX   = 0XFE;    //16位定时器0基于8位定时器0
    PITLD0   = 2199;    //16位定时器初值，（199+1）*（2199+1）/88M =5MS
    PITINTE |= 0X01;    //使能定时器0溢出中断
    PITFLT  |= 0X01;    //强制加载定时器0
    PITCE   |= 0X01;    //使能定时器0，开始定时
    
    
}


