
//PORTA读取摄像头数据

// PORTB读取右边编码器脉冲
//PORTAD读取左边编码器脉冲






#include "IO.h"


/*******************************************************
 函数名Init_PORTA()
 参数：config   0--输入
                1--输出
       
 功能：初始化PORTA
*******************************************************/
void Init_PORTA(unsigned char config)
{
    if(config==0)
    {
        DDRA=0x00; 
    }
    else
    {
        DDRA=0xff;
    }
}
/*******************************************************
 函数名：Set_PORTA()
 参数：config   0--PORTA=00000000
                1--PORTA=11111111
       
 功能：设置PORTA输出高低电平
*******************************************************/
void Set_PORTA(uchar config)
{
    if(config==0)
    {
        PORTA=0x00; 
    }
    else
    {
        PORTA=0xff;
    }
}
/*******************************************************
 函数名：Read_PORTA()
 参数：无
 返回值:PORTA的数据     
 功能：读取PORTA电平
*******************************************************/
uchar Read_PORTA(void)
{
    return PORTA;
}



/*******************************************************
 函数名Init_PORTB()
 参数：config   0--输入
                1--输出
       
 功能：初始化PORTA
*******************************************************/
void Init_PORTB(uchar config)
{
    if(config==0)
    {
        DDRB=0x00; 
    }
    else
    {
        DDRB=0xff;
    }
}
/*******************************************************
 函数名：Set_PORTB()
 参数：config   0--PORTB=00000000
                1--PORTB=11111111
       
 功能：设置PORTB输出高低电平
*******************************************************/
void Set_PORTB(uchar config)
{
    if(config==0)
    {
        PORTB=0x00; 
    }
    else
    {
        PORTB=0xff;
    }
}
/*******************************************************
 函数名：Read_PORTB()
 参数：无
 返回值:PORTB的数据     
 功能：读取PORTB电平
*******************************************************/
uchar Read_PORTB(void)
{
    return PORTB;
}


/*******************************************************
 函数名Init_PORTAD()
 参数：config   0--输入
                1--输出
       
 功能：初始化PORTAD
*******************************************************/
void Init_PORTAD(uchar config)
{    
    
    if(config==0)
    {
        ATD0DIEN=0xffff;
        PER1AD0=0XFF;  //上拉
        DDR1AD0=0x00;    
    }
    else
    {
	     ATD0DIEN=0xffff;
       DDR1AD0=0xff;
    }
}
/*******************************************************
 函数名：Set_PORTAD()
 参数：config   0--PORTB=00000000
                1--PORTB=11111111
       
 功能：设置PORTAD输出高低电平
*******************************************************/
void Set_PORTAD(uchar config)
{
    if(config==0)
    {
        PT1AD0=0x00; 
    }
    else
    {
        PT1AD0=0xff;
    }
}
/*******************************************************
 函数名：Read_PORTAD()
 参数：无
 返回值:PORTAD的数据     
 功能：读取PORTAD电平
*******************************************************/
uchar Read_PORTAD(void)
{
    
    
   
    return PT1AD0;
}


/*******************************************************
 函数名Init_PTM()
 参数：config   0--输入
                1--输出
       
 功能：初始化PTM
*******************************************************/
void Init_PTM(uchar config)
{
    if(config==0)
    {
        DDRM=0x00; 
    }
    else
    {
        DDRM=0xff;
    }
}

/*******************************************************
 函数名：Set_PTM()
 参数：config   0--PTM=00000000
                1--PTM=11111111
       
 功能：设置PTM输出高低电平
*******************************************************/
void Set_PTM(uchar config)
{
    if(config==0)
    {
        PTM=0x00; 
    }
    else
    {
        PTM=0xff;
    }
}
/*******************************************************
 函数名：Read_PORTM()
 参数：无
 返回值:PORTM的数据     
 功能：读取PORTA电平
*******************************************************/
uchar Read_PTM(void)
{
    return PTM;
}







