#include "PWM.h"


/****************************************************************************
 函数名：PWM_Init
 参数：无
 功能：PWM方波初始化输出。 
       //----P0、P1、P4、P5--->A/SA---//   //----P2、P3、P6、P7--->B/SB---//
 
                             PWMO,PWM1级联PWMO1 ___10KHz
 
                             PWM2,PWM3级联PWM23 ___50Hz
                             
                             PWM4,PWM5级联PWM45 ___10KHz
                             
                             PWM6,PWM7级联PWM67
***************************************************************************/
void PWM_Init(void)       
{  
     PWME= 0x00;            // 禁止PWM
     
/***********************PWM时钟始终初始化**********************************/ 
     PWMPRCLK= 0x11;     //Clock(x)预分频设置   A=B=80M/2=40MHz  (依照数据手册跟总线时钟修改)
     PWMSCLA = 2;        //Clock S(x)预分频设置,Clock SA = Clock A / (2 * PWMSCLA),SA=A/2/2 = 10M 
     PWMSCLB = 20;       //Clock S(x)预分频设置,Clock SB = Clock B / (2 * PWMSCLB),SB=B/2/20= 1M 
/***************************************************************************/
     
/***********************PWM01级联初始化--10KHz--左电机控制**********************/      
     PWMCTL_CON01 = 1;    //通道联级和工作模式设置.16位中PWM0作为高8位PWM1作为低8位
     PWMCLK_PCLK1 = 1;    //时钟源的选择   PWM1 --->SA
     PWMCAE_CAE1  = 0;    //对齐方式选择   左对齐输出
     PWMPOL_PPOL1 = 1;    //极性设置       设置输出起始电平为1
     PWMCNT01     = 0;    //PWM01通道计数器寄存器
     PWMPER01     = 1000; //周期设置       f = SA / 1000 = 10K
     PWMDTY01     = 0;    //占空比设置  初始化为0，电机不运动     
     PWME_PWME1   = 1;    //使能 PWM 
/***************************************************************************/

/**********************PWM45级联初始化--10KHz--右电机控制*********************/     
     PWMCTL_CON45 = 1;   //通道联级和工作模式设置 16位中PWM4作为高8位PWM5作为低8位  
     PWMCLK_PCLK5 = 1;   //时钟源的选择      PWM5 ----> SA
     PWMCAE_CAE5  = 0;   //对齐方式选择      左对齐输出
     PWMPOL_PPOL5 = 1;   //极性设置     设置输出起始电平为1
     PWMCNT45     = 0;   //PWM45通道计数器寄存器
     PWMPER45     = 1000;//周期设置     f = SA / 1000 = 10K
     PWMDTY45     = 0;   //占空比设置  初始化为0，电机不运动
     PWME_PWME5   = 1;   //使能 PWM    
/***************************************************************************/
       
/********************PWM23级联初始化--50Hz--舵机控制***********************/     
     PWMCTL_CON23 = 1;  //通道联级和工作模式设置 16位中PWM2作为高8位PWM3作为低8位  
     PWMCLK_PCLK3 = 1;  //时钟源的选择        PWM3 ----> SB
     PWMCAE_CAE3  = 0;  //对齐方式选择        左对齐输出
     PWMPOL_PPOL3 = 1;  //极性设置            设置输出起始电平为1
     PWMCNT23     = 0;  //PWM23通道计数器寄存器
     PWMPER23     = 20000;  //周期设置      f = SB / 20000 = 50 Hz
     PWMDTY23     = 920;   //占空比设置   居中
     PWME_PWME3   = 1;      //使能 PWM 
/***************************************************************************/
     
    
}

/*******************************************************
 函数名：Left_Motor_Speed
 参数：duty  PWM01级联占空比
 功能：调节左边电机的速度          
*******************************************************/
void Left_Motor_Speed(uint duty)
{
    PWMDTY01=duty;  
}

/*******************************************************
 函数名：Right_Motor_Speed
 参数：duty  PWM45级联占空比
 功能：调节右边电机的速度
*******************************************************/
void Right_Motor_Speed(uint duty)
{
    PWMDTY45=duty;  
}


