#ifndef PLL_H
#define PLL_H



#include "COMMON.h"


/*******************************************************
 函数名：SetSysCLK_16M
 参数：无
       锁相环时钟：PLLCLK=2*OSCLK*(SYNR+1) / (REFDV+1)
       总线时钟：BUSCLK=PLLCLK / 2
 功能：时钟初始化16M
*******************************************************/
void SetSysCLK_16M (void);

/*******************************************************
 函数名：SetSysCLK_32M
 参数：无
       锁相环时钟：PLLCLK=2*OSCLK*(SYNR+1) / (REFDV+1)
       总线时钟：BUSCLK=PLLCLK / 2
 功能：时钟初始化32M
*******************************************************/
void SetSysCLK_32M (void);

/*******************************************************
 函数名：SetSysCLK_40M
 参数：无
       锁相环时钟：PLLCLK=2*OSCLK*(SYNR+1) / (REFDV+1)
       总线时钟：BUSCLK=PLLCLK / 2
 功能：时钟初始化40M
*******************************************************/
void SetSysCLK_40M (void);

/*******************************************************
 函数名：SetSysCLK_48M
 参数：无
       锁相环时钟：PLLCLK=2*OSCLK*(SYNR+1) / (REFDV+1)
       总线时钟：BUSCLK=PLLCLK / 2
 功能：时钟初始化48M
*******************************************************/
void SetSysCLK_48M (void);

/*******************************************************
 函数名：SetSysCLK_64M
 参数：无
       锁相环时钟：PLLCLK=2*OSCLK*(SYNR+1) / (REFDV+1)
       总线时钟：BUSCLK=PLLCLK / 2
 功能：时钟初始化64M
*******************************************************/
void SetSysCLK_64M (void);

/*******************************************************
 函数名：SetSysCLK_80M
 参数：无
       锁相环时钟：PLLCLK=2*OSCLK*(SYNR+1) / (REFDV+1)
       总线时钟：BUSCLK=PLLCLK / 2
 功能：时钟初始化80M
*******************************************************/
void SetSysCLK_80M (void);

/*******************************************************
 函数名：SetSysCLK_88M
 参数：无
       锁相环时钟：PLLCLK=2*OSCLK*(SYNR+1) / (REFDV+1)
       总线时钟：BUSCLK=PLLCLK / 2
 功能：时钟初始化88M
*******************************************************/
void SetSysCLK_88M (void);

/*******************************************************
 函数名：SetSysCLK_96M
 参数：无
       锁相环时钟：PLLCLK=2*OSCLK*(SYNR+1) / (REFDV+1)
       总线时钟：BUSCLK=PLLCLK / 2
 功能：时钟初始化96M
*******************************************************/
void SetSysCLK_96M(void);










#endif