#include "SCI.h"


 /*******************************************************
 函数名：SCI0_Init()
 参数：无     
 功能：初始化串口0
*******************************************************/
void SCI0_Init(void)
{
    SCI0BD=43;     //设置波特率为115200 （80MHz时）   
    SCI0CR1=0;     //正常8位模式、无奇偶校验   
    SCI0CR2=0X2C;  //发送允许   接收中断允许  
}

/*******************************************************
 函数名：SCI0_Write()
 参数：Sendchar:写入的数据     
 功能：向串口写入数据
*******************************************************/
void SCI0_Write(uchar sendchar) 
{
    while (!(SCI0SR1&0x80));
    SCI0DRH=0;
    SCI0DRL=sendchar;
}