#ifndef PWM_H
#define PWM_H


#include "COMMON.h"

/****************************************************************************
 函数名：PWM_Init
 参数：无
 功能：PWM方波初始化输出。PWM01级联占空比 = PWM45级联占空比 =0 (电机不运动)
       //----P0、P1、P4、P5--->A/SA---//   //----P2、P3、P6、P7--->B/SB---//
 
                             PWMO,PWM1级联PWMO1 ___10KHz                                                        
                             PWM4,PWM5级联PWM45 ___10KHz 
                             PWM2,PWM3级联PWM23 ___50Hz                            
                             PWM6,PWM7级联PWM67（略）
***************************************************************************/
void PWM_Init(void);

/*******************************************************
 函数名：Left_Motor_Speed
 参数：duty  PWM01级联占空比
 功能：调节左边电机的速度
*******************************************************/
void Left_Motor_Speed(uint duty);

/*******************************************************
 函数名：Right_Motor_Speed
 参数：duty  PWM45级联占空比
 功能：调节右边电机的速度
*******************************************************/
void Right_Motor_Speed(uint duty);






#endif