#include "Users.h"

extern uchar vsync;	 //场同步信号标志当为1时场开始，为2结束
extern uchar StartStop;      //起跑跟终点信号


/*******************************************************
 函数名：Init_IC1()
 参数：无     
 功能：初始化PT1输入捕抓  （检测起跑信号跟终点信号 ）
*******************************************************/
void Init_IC1(void)
{
	TIOS=0x00;       //0-7 开放输入捕捉功能         
	TCTL4_EDG1A=1;  
	TCTL4_EDG1B=1;   //PT1任何边沿触发  
	TSCR1=0x80;      //定时器使能     
	TIE_C1I=1;       //输入捕捉/输出比较通道1中断使能   
	TFLG1=0xFF;      //中断标志位写1清零 
}

/*******************************************************
 函数名：WAIT_START()
 参数：无     
 功能：等待起跑信号（PT1输入捕抓中断）
*******************************************************/
void WAIT_START(void)
{
	while(StartStop==0);//等待灯塔熄灭 
    StartStop=0;    
}

/*******************************************************
 函数名：CHECK_STOP()
 参数：无     
 功能：检测终点信号（PT1输入捕抓中断）
*******************************************************/
void CHECK_STOP(void)
{
    while(StartStop>0)
	{
		Left_Motor_Forward(0);
		Right_Motor_Forward(0);
	}    
}

/*******************************************************
 函数名：Get_Speed(void)
 参数：无     
 返回：当前速度脉冲
 功能：获取当前速度脉冲
*******************************************************/
uint Get_Speed(void)
{
    uint Speed=0;
    Speed= (uint)( ( Left_Curret_Spped()+Right_Curret_Spped() )>>1 );
    Spped_Clear();
    return  Speed;
}
/*******************************************************
 函数名：Ignore(void)
 参数：无     
 返回：无
 功能：等待图像稳定
*******************************************************/
void Ignore(void) 
{
  uchar i;
  for(i=30;i>=1;i--) 
  {
     while(vsync<2);     //等待图像存入FIFO完毕
	IMG_START();        //图像采集启动(实时更新FIFO中的图像) 
  }
  
}

/*******************************************************
 函数名：Car_Init()
 参数：无     
 功能：车初始化
*******************************************************/
void Car_Init(void)
{
    SetSysCLK_80M();       //初始化系统总线时钟为80M
    FIFO_Init();           //初始化FIFO控制引脚
    while(SCCB_Init()==0); //初始化摄像头寄存器
    Init_IC0();            //初始化PT0下降沿触发（场同步)
    SCI0_Init();           //初始化串口0，波特率56000，八位无奇偶校验
}