#ifndef IMAGE_H
#define IMAGE_H


#include "COMMON.h"
#include "Users.h"

#define FZ 60

#define  ROW     25           //图像要采集24行（0--23）
#define  COLUMN   80          //图像采集的80列 (0--79)

#define WHITE  40    //定义二值化白色为0XFF
#define BLACK  0    //定义二值化黑色为0X00

#define RGB565_RED    0XF800    //取红色分量
#define RGB565_GREEN  0X07E0    //取绿色分量
#define RGB565_BLUE   0X001F    //取蓝色分量


//采集的间隔（跳过2个读时钟,即跳过1个像素）
#define J1() 	FIFO_RCLK_L();FIFO_RCLK_H();FIFO_RCLK_L();FIFO_RCLK_H()





/*******************************************************
 函数名：GET_IMG()
 参数：无
 功能：获取一幅80X40的图像
*******************************************************/
void GET_IMG(void);

/*******************************************************
 函数名:IMG_PROCESS()
 参数：无
 功能:将80X25的图像处理 
*******************************************************/
void IMG_PROCESS(void);


/*******************************************************
 函数名：SEND_IMG()
 参数：无
 功能:将80X25的图像发送给上位机
*******************************************************/
void SEND_IMG(void);

/*******************************************************
 函数名：SHOW_Black_Line(void)
 参数：无
 功能:将80X25的图像发送给上位机
*******************************************************/
void SHOW_Black_Line(void);











#endif