#ifndef Speed_H
#define Speed_H

#include "COMMON.h"
#include "Users.h"

/*************************************************
函数名: Init_Spped_M()
描述: 初始化测速模块
输入: 无
输出: 无
*************************************************/ 
void Init_Spped_M(void);

/*************************************************
函数名: Left_Curret_Spped()
描述: 获取左电机的左右速度
输入: 无
输出: 当前左电机的速度
*************************************************/
uchar Left_Curret_Spped(void);

/*************************************************
函数名: Left_Curret_Spped()
描述: 获取左电机的左右速度
输入: 无
输出: 当前左电机的速度
*************************************************/
uchar Right_Curret_Spped(void);

/*************************************************
函数名: Spped_Clear()
描述: 测速清零
输入: 无
输出: 无
*************************************************/
void  Spped_Clear(void);


/*************************************************
函数名: Speed_Control()
描述: 测速清零
输入: 无
输出: 无
*************************************************/
void Speed_Control(void);








#endif